tripglob/logs/Flight/PNR_Retrieve_Req20240526_220846_7728.xml

<?xml version="1.0" encoding="UTF-8"?>
				<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:sec="http://xml.amadeus.com/2010/06/Security_v1" xmlns:typ="http://xml.amadeus.com/2010/06/Type">
				<soapenv:Header>
				<add:MessageID xmlns:add="http://www.w3.org/2005/08/addressing">urn:uuid:0001-9a2830bb-66536596-f796-fa716034</add:MessageID>
				<add:Action xmlns:add="http://www.w3.org/2005/08/addressing">http://webservices.amadeus.com/PNRRET_17_1_1A</add:Action>
				<add:To xmlns:add="http://www.w3.org/2005/08/addressing">https://nodeD1.test.webservices.amadeus.com/</add:To>
				<link:TransactionFlowLink xmlns:link="http://wsdl.amadeus.com/2010/06/ws/Link_v1"/>
				<oas:Security xmlns:oas="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd">
				<oas:UsernameToken oas1:Id="UsernameToken-1" xmlns:oas1="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd">
				<oas:Username></oas:Username>
				<oas:Nonce EncodingType="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-soap-message-security-1.0#Base64Binary"></oas:Nonce>
				<oas:Password Type="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-username-token-profile-1.0#PasswordDigest"></oas:Password>
				<oas1:Created></oas1:Created>
				</oas:UsernameToken>
				</oas:Security>
				<AMA_SecurityHostedUser xmlns="http://xml.amadeus.com/2010/06/Security_v1">
				<UserID AgentDutyCode="SU" RequestorType="U" PseudoCityCode="" POS_Type="1"/>
				</AMA_SecurityHostedUser>
				<awsse:Session TransactionStatusCode="Start" xmlns:awsse="http://xml.amadeus.com/2010/06/Session_v3"/>
				</soapenv:Header>
				<soapenv:Body>
				<PNR_Retrieve xmlns="http://xml.amadeus.com/PNRRET_17_1_1A">
				<retrievalFacts>
				<retrieve>
				<type>2</type>
				</retrieve>
				<reservationOrProfileIdentifier>
				<reservation>
				<controlNumber>UQLM2Y</controlNumber>
				</reservation>
				</reservationOrProfileIdentifier>
				</retrievalFacts>
				</PNR_Retrieve>
				</soapenv:Body>
				</soapenv:Envelope>